posts/2015-01-13-the-fifteenth-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Fifteenth Sunday After Pentecost

In response to a sermon on Daniel 3:

How shall we respond to the furnaces of life?\\
We make empty promises, saying that God must deliver,\\
Mere feeble attempts to bind God's will\\
With pledges that we cannot guarantee.

Instead, we are called to be strong and courageous,\\
And if rescue is promised,\\
Then of what value is courage?

Lord,\\
Give us the strength to face the flames\\
Like the three in Babylon,\\
Who dared not promise to show what God would do for them,\\
But promised instead to show what they would do for God.


#+begin_tagline
Tagged: prayer
#+end_tagline
